"use strict";



import { arrOfComments } from "./variables.js";
import { renderApp } from "./render.js";

//***************************************************************************************************************
//*********************************************************************************************************
//---- Выполняемый код --------------------
//*********************************************************************************************************
//***************************************************************************************************************

//elComments.innerHTML = 'Пожалуйста подождите, комментарии загружаются...';    //Вставляем заглушку на место пока не прогрузившегося блока с комментами

//askDataServ();      //Заправшиваем данные с сервера и рендерим блок с комментами
renderApp(arrOfComments);



console.log("It works!");