"use strict";



import { arrOfComments } from "./variables.js";
import { renderApp } from "./render.js";
import { getDataFromLocalStorage, token } from "./loginComponents.js";
import { askDataServ } from "./api.js";

//***************************************************************************************************************
//*********************************************************************************************************
//---- Выполняемый код --------------------
//*********************************************************************************************************
//***************************************************************************************************************
getDataFromLocalStorage(); //получаем токен и юзера из локал стораджа
if (!token) {
    renderApp(arrOfComments);       //Если токена нет то вызываем функцию рендера, которая в свою очередь по нулевому токену вызовет рендер формы с предложением авторизоваться
} else askDataServ();               //Если токен есть, то запрашиваем данные на сервера, а затем вызовется рендер функция страницы с формой добавления коммента
//renderApp(arrOfComments);

console.log("It works!");